Revit 2026 API

# FabricSheetGetSegmentParameterIdsAndLengths Method

---

Returns the array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.).

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IDictionary<ElementId, double> GetSegmentParameterIdsAndLengths(
	bool rounded
)
```
```vb
Public Function GetSegmentParameterIdsAndLengths (
	rounded As Boolean
) As IDictionary(Of ElementId, Double)
```
```cpp
public:
IDictionary<ElementId^, double>^ GetSegmentParameterIdsAndLengths(
	bool rounded
)
```
```fsharp
member GetSegmentParameterIdsAndLengths :
        rounded : bool -> IDictionary<ElementId, float>
```

#### Parameters

rounded Boolean
     Set to true to return rounded values for segments lengths.

#### Return Value

IDictionaryElementId, Double Array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.) is returned for bend fabric sheet. For flat fabric sheet (not bent) empty array is returned.

This method does not provide alphabetical nor any other order of returned parameters.

#### Reference

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace